# Scratch

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.linspace(1950, 2022, num=50)

array([1950.        , 1951.46938776, 1952.93877551, 1954.40816327,
       1955.87755102, 1957.34693878, 1958.81632653, 1960.28571429,
       1961.75510204, 1963.2244898 , 1964.69387755, 1966.16326531,
       1967.63265306, 1969.10204082, 1970.57142857, 1972.04081633,
       1973.51020408, 1974.97959184, 1976.44897959, 1977.91836735,
       1979.3877551 , 1980.85714286, 1982.32653061, 1983.79591837,
       1985.26530612, 1986.73469388, 1988.20408163, 1989.67346939,
       1991.14285714, 1992.6122449 , 1994.08163265, 1995.55102041,
       1997.02040816, 1998.48979592, 1999.95918367, 2001.42857143,
       2002.89795918, 2004.36734694, 2005.83673469, 2007.30612245,
       2008.7755102 , 2010.24489796, 2011.71428571, 2013.18367347,
       2014.65306122, 2016.12244898, 2017.59183673, 2019.06122449,
       2020.53061224, 2022.        ])

In [3]:
np.linspace(1950, 2022, 50)

array([1950.        , 1951.46938776, 1952.93877551, 1954.40816327,
       1955.87755102, 1957.34693878, 1958.81632653, 1960.28571429,
       1961.75510204, 1963.2244898 , 1964.69387755, 1966.16326531,
       1967.63265306, 1969.10204082, 1970.57142857, 1972.04081633,
       1973.51020408, 1974.97959184, 1976.44897959, 1977.91836735,
       1979.3877551 , 1980.85714286, 1982.32653061, 1983.79591837,
       1985.26530612, 1986.73469388, 1988.20408163, 1989.67346939,
       1991.14285714, 1992.6122449 , 1994.08163265, 1995.55102041,
       1997.02040816, 1998.48979592, 1999.95918367, 2001.42857143,
       2002.89795918, 2004.36734694, 2005.83673469, 2007.30612245,
       2008.7755102 , 2010.24489796, 2011.71428571, 2013.18367347,
       2014.65306122, 2016.12244898, 2017.59183673, 2019.06122449,
       2020.53061224, 2022.        ])

In [4]:
interval = {'1 Hour', '1h', 
            '1 Day', '1d', 
            '5 Days', '5d', 
            '1 Week', '1wk', 
            '1 Month', '1mo', 
            '3 Months', '3mo'}

---

In [5]:
df = pd.DataFrame({"Col1": [10, 20, 15, 30, 45],
                   "Col2": [13, 23, 18, 33, 48],
                   "Col3": [17, 27, 22, 37, 52]},
                  index=pd.date_range("2020-01-01", "2020-01-05"))
df

            Col1  Col2  Col3
2020-01-01    10    13    17
2020-01-02    20    23    27
2020-01-03    15    18    22
2020-01-04    30    33    37
2020-01-05    45    48    52

In [7]:
df['hello'] = df['Col3'].shift(periods=-1)

In [8]:
df

            Col1  Col2  Col3  hello
2020-01-01    10    13    17   27.0
2020-01-02    20    23    27   22.0
2020-01-03    15    18    22   37.0
2020-01-04    30    33    37   52.0
2020-01-05    45    48    52    NaN

---

In [9]:
df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [0, 20, 30], [40, 20, 30]], 
                  index=[4, 5, 6, 7], columns=['A', 'B', 'C'])

In [10]:
df

    A   B   C
4   0   2   3
5   0   4   1
6   0  20  30
7  40  20  30

In [15]:
ne = df.loc[(df.index < 6)]

In [16]:
ne

   A  B   C
4  0  2  99
5  0  4  99